import random

QUESTIONS = [
{"id":30345,"q":"1600年におきた天下分け目の戦いとは？","a":"関ヶ原の戦い","choices":["関ヶ原の戦い","大坂の陣","長篠の戦い","桶狭間の戦い","川中島の戦い"]},
{"id":30346,"q":"関ヶ原の戦いで西軍の中心人物は？","a":"石田三成","choices":["徳川家康","石田三成","豊臣秀吉","徳川秀忠","毛利輝元"]},
{"id":30347,"q":"関ヶ原の戦いで東軍の中心人物は？","a":"徳川家康","choices":["石田三成","豊臣秀頼","徳川家康","毛利輝元","明智光秀"]},
{"id":30348,"q":"関ヶ原の戦いで勝利したのは？","a":"東軍","choices":["西軍","東軍","官軍","平氏","奥州藤原氏"]},
{"id":30349,"q":"1603年に徳川家康が任命された役職は？","a":"征夷大将軍","choices":["関白","太政大臣","征夷大将軍","摂政","大老"]},
{"id":30350,"q":"家康が将軍職を秀忠に譲った理由は江戸幕府が徳川家の「？」であることを知らしめるため","a":"世襲","choices":["世襲","独裁","合議","共和","院政"]},
{"id":30351,"q":"家康が秀忠に将軍職を譲ったあとについた役職は？","a":"大御所","choices":["老中","大老","大御所","若年寄","関白"]},
{"id":30352,"q":"江戸幕府後も大阪城を拠点に徳川家の脅威であり続けた一族は？","a":"豊臣","choices":["織田","毛利","豊臣","武田","北条"]},
{"id":30353,"q":"1614年、1615年に徳川家が豊臣家を攻め滅ぼした戦いは？","a":"大坂の陣","choices":["関ヶ原の戦い","大坂の陣","長篠の戦い","島原の乱","応仁の乱"]},
{"id":30354,"q":"江戸時代の武士の身分、1万石以上の領主とは？","a":"大名","choices":["旗本","御家人","大名","足軽","奉公人"]},
{"id":30355,"q":"江戸時代の武士の身分、1万石未満で将軍にあえる幕臣とは？","a":"旗本","choices":["大名","御家人","旗本","足軽","町人"]},
{"id":30356,"q":"江戸時代の武士の身分、1万石未満で将軍にあえない幕臣とは？","a":"御家人","choices":["旗本","御家人","大名","老中","若年寄"]},
{"id":30357,"q":"江戸時代の大名、徳川将軍家の一族とは？","a":"親藩","choices":["譜代","外様","親藩","旗本","御家人"]},
{"id":30358,"q":"江戸時代の大名、古くから徳川家の家臣であった大名とは？","a":"譜代","choices":["親藩","外様","譜代","旗本","御家人"]},
{"id":30359,"q":"江戸時代の大名、関ヶ原の戦いのころから徳川家に従うようになった大名とは？","a":"外様","choices":["親藩","譜代","外様","旗本","御家人"]},
{"id":30360,"q":"江戸や重要な場所の近くには①をおかず、幕府の直接の支配地である②や③・④の領地で固めた。①は？","a":"外様","choices":["外様","親藩","譜代","天領","旗本"]},
{"id":30361,"q":"江戸や重要な場所の近くには①をおかず、幕府の直接の支配地である②や③・④の領地で固めた。②は？","a":"天領","choices":["外様","親藩","譜代","天領","御家人"]},
{"id":30362,"q":"江戸や重要な場所の近くには①をおかず、幕府の直接の支配地である②や③・④の領地で固めた。③は？","a":"親藩","choices":["外様","親藩","譜代","天領","旗本"]},
{"id":30363,"q":"江戸や重要な場所の近くには①をおかず、幕府の直接の支配地である②や③・④の領地で固めた。④は？","a":"譜代","choices":["外様","親藩","譜代","天領","御家人"]},
{"id":30364,"q":"江戸時代の政治の仕組みを完成させたとされる3代将軍は？","a":"家光","choices":["家康","秀忠","家光","綱吉","吉宗"]},
{"id":30365,"q":"江戸時代、将軍の下で政治全般を統括したのは？","a":"老中","choices":["大老","老中","若年寄","勘定奉行","町奉行"]},
{"id":30366,"q":"江戸時代、老中の補佐をしたのは？","a":"若年寄","choices":["大老","老中","若年寄","勘定奉行","寺社奉行"]},
{"id":30367,"q":"江戸時代、非常時にのみおかれた幕府の最高職は？","a":"大老","choices":["老中","若年寄","大老","勘定奉行","町奉行"]},
{"id":30368,"q":"老中、若年寄、大老に任命されたのは？","a":"譜代大名","choices":["親藩大名","外様大名","譜代大名","旗本","御家人"]},
{"id":30369,"q":"老中の下におかれ、行政・警察・裁判を担う役職は？","a":"三奉行","choices":["三奉行","六波羅探題","守護","地頭","大老"]},
{"id":30370,"q":"老中の下におかれ、幕府の財政や幕領の管理を担う役職は？","a":"勘定奉行","choices":["寺社奉行","町奉行","勘定奉行","若年寄","大老"]},
{"id":30371,"q":"三奉行、勘定奉行に任命されたのは？","a":"旗本","choices":["大名","旗本","御家人","町人","農民"]},
{"id":30372,"q":"反乱の恐れがあるため幕府の要職に就くことが原則なかったのは？","a":"外様大名","choices":["親藩大名","譜代大名","外様大名","旗本","御家人"]},
{"id":30373,"q":"江戸幕府が大名を統制するために制定した法律は？","a":"武家諸法度","choices":["御成敗式目","武家諸法度","公事方御定書","禁中並公家諸法度","十七条の憲法"]},
{"id":30374,"q":"参勤交代とはを定めたのはだれ？","a":"家光","choices":["家康","秀忠","家光","綱吉","吉宗"]},
{"id":30375,"q":"参勤交代では大名は①年おきに②と③を往復する制度。①は？","a":"2","choices":["1","2","3","4","5"]},
{"id":30376,"q":"参勤交代では大名は2年おきに②と③を往復する制度。②は？","a":"江戸","choices":["京都","大阪","江戸","鎌倉","長崎"]},
{"id":30377,"q":"参勤交代では大名は2年おきに②と③を往復する制度。③は？","a":"領地","choices":["京都","大阪","長崎","領地","幕府"]},
]

# 任意でシャッフル関数
def shuffled():
    items = QUESTIONS.copy()
    random.shuffle(items)
    return items





